# shell integrations
brew "jq"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-meslo-for-powerlevel10k"
cask "font-symbols-only-nerd-font"

# essentials
cask "raycast"
cask "slack"
cask "spotify"
cask "google-chrome"
cask "vlc"
cask "zoom"
cask "betterdisplay"

# social
cask "signal"
cask "discord"
cask "whatsapp"

# proton
cask "proton-pass"
cask "protonvpn"

# mac app store dependencies
brew "mas"
mas "Endel", id: 1346247457
mas "Proton Pass for Safari", id: 6502835663

# personal
cask "logi-options+"
cask "elgato-stream-deck"
cask "autodesk-fusion"
cask "bambu-studio"

# docker
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# jetbrains
cask "datagrip"
cask "intellij-idea"

# vscode
cask "visual-studio-code"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dracula-theme.theme-dracula"
vscode "github.copilot"
vscode "github.copilot-chat"
